---
kind: other
id: Methods.T:Autodesk.Revit.DB.GeometryInstance
source: html/d3567707-4f77-5ed8-16f4-6d57411cf41b.htm
---
# GeometryInstance Methods

Causes the object to release immediately any resources it may be utilizing.